In [1]:
import pandas as pd

In [2]:
# df = pd.read_csv("transactions.csv")
df = pd.read_csv("transactions.csv")

# df = pd.read_excel("transactions.xlsx", sheet_name=0) 
# df = pd.read_excel("transactions.xlsx", sheet_name="main")

# df = pd.read_json("transactions.json")

# -------------------------------------------------------------------

# df.to_csv("transactions.csv", index=False)

# df.to_excel("transactions.xlsx", sheet_name=0, index=False)
# df.to_excel("transactions.xlsx", sheet_name="main", index=False)

# df.to_json("transactions.json", index=False)

In [3]:
df

      customer_id           name transaction_date       amount category
0             103  Charlie Davis       2022-01-01   759.037390        A
1             436    Alice Brown       2022-01-01  1096.181632        C
2             861    Alice Brown       2022-01-02  1158.623597        B
3             271     Bob Wilson       2022-01-02   859.027857      NaN
4             107     John Smith       2022-01-02   712.566977        C
...           ...            ...              ...          ...      ...
1045           85     John Smith       2023-12-27   761.082210        C
1046           78    Alice Brown       2023-12-27  1003.574745        B
1047          457  Charlie Davis       2023-12-28   832.511670        C
1048          878  Charlie Davis       2023-12-28   723.357978        B
1049            1     Bob Wilson       2023-12-30   721.611291        C

[1050 rows x 5 columns]

In [4]:
df.head()

   customer_id           name transaction_date       amount category
0          103  Charlie Davis       2022-01-01   759.037390        A
1          436    Alice Brown       2022-01-01  1096.181632        C
2          861    Alice Brown       2022-01-02  1158.623597        B
3          271     Bob Wilson       2022-01-02   859.027857      NaN
4          107     John Smith       2022-01-02   712.566977        C

In [5]:
df.head(10)

   customer_id           name transaction_date       amount category
0          103  Charlie Davis       2022-01-01   759.037390        A
1          436    Alice Brown       2022-01-01  1096.181632        C
2          861    Alice Brown       2022-01-02  1158.623597        B
3          271     Bob Wilson       2022-01-02   859.027857      NaN
4          107     John Smith       2022-01-02   712.566977        C
5           72    Alice Brown       2022-01-03   749.303000        B
6          701    Alice Brown       2022-01-03  1280.716021        C
7           21     Bob Wilson       2022-01-03   877.266866        C
8          615     Bob Wilson       2022-01-07  1161.533889        C
9          122     John Smith       2022-01-07  1074.798141        B

In [6]:
df.tail()

      customer_id           name transaction_date       amount category
1045           85     John Smith       2023-12-27   761.082210        C
1046           78    Alice Brown       2023-12-27  1003.574745        B
1047          457  Charlie Davis       2023-12-28   832.511670        C
1048          878  Charlie Davis       2023-12-28   723.357978        B
1049            1     Bob Wilson       2023-12-30   721.611291        C

In [7]:
df.tail(8)

      customer_id           name transaction_date       amount category
1042          458  Charlie Davis       2023-12-26   844.239348        B
1043           83    Alice Brown       2023-12-26   814.955767        C
1044          145     John Smith       2023-12-27  1250.943452        B
1045           85     John Smith       2023-12-27   761.082210        C
1046           78    Alice Brown       2023-12-27  1003.574745        B
1047          457  Charlie Davis       2023-12-28   832.511670        C
1048          878  Charlie Davis       2023-12-28   723.357978        B
1049            1     Bob Wilson       2023-12-30   721.611291        C

In [8]:
df.sample()
df.sample(5)

     customer_id           name transaction_date       amount category
492          256     John Smith       2022-12-10  1043.229186        B
295          130    Alice Brown       2022-08-04  1175.956810        B
50           958     John Smith       2022-01-31  1137.094406        B
795          718     Bob Wilson       2023-07-10   700.080816        A
997          798  Charlie Davis       2023-11-20  1154.386124        B

In [9]:
# Missing Values
df.isna()

      customer_id   name  transaction_date  amount  category
0           False  False             False   False     False
1           False  False             False   False     False
2           False  False             False   False     False
3           False  False             False   False      True
4           False  False             False   False     False
...           ...    ...               ...     ...       ...
1045        False  False             False   False     False
1046        False  False             False   False     False
1047        False  False             False   False     False
1048        False  False             False   False     False
1049        False  False             False   False     False

[1050 rows x 5 columns]

In [10]:
df.isna().sum()

customer_id          0
name                 0
transaction_date     0
amount               0
category            45
dtype: int64

In [11]:
df.isnull()

      customer_id   name  transaction_date  amount  category
0           False  False             False   False     False
1           False  False             False   False     False
2           False  False             False   False     False
3           False  False             False   False      True
4           False  False             False   False     False
...           ...    ...               ...     ...       ...
1045        False  False             False   False     False
1046        False  False             False   False     False
1047        False  False             False   False     False
1048        False  False             False   False     False
1049        False  False             False   False     False

[1050 rows x 5 columns]

In [12]:
df.isnull().sum()

customer_id          0
name                 0
transaction_date     0
amount               0
category            45
dtype: int64

In [13]:
# Categorical / Qualitative Data
# Numerical / Quantitative Data

In [14]:
df

      customer_id           name transaction_date       amount category
0             103  Charlie Davis       2022-01-01   759.037390        A
1             436    Alice Brown       2022-01-01  1096.181632        C
2             861    Alice Brown       2022-01-02  1158.623597        B
3             271     Bob Wilson       2022-01-02   859.027857      NaN
4             107     John Smith       2022-01-02   712.566977        C
...           ...            ...              ...          ...      ...
1045           85     John Smith       2023-12-27   761.082210        C
1046           78    Alice Brown       2023-12-27  1003.574745        B
1047          457  Charlie Davis       2023-12-28   832.511670        C
1048          878  Charlie Davis       2023-12-28   723.357978        B
1049            1     Bob Wilson       2023-12-30   721.611291        C

[1050 rows x 5 columns]

In [15]:
df.dtypes

customer_id           int64
name                 object
transaction_date     object
amount              float64
category             object
dtype: object

In [16]:
df['transaction_date']

0       2022-01-01
1       2022-01-01
2       2022-01-02
3       2022-01-02
4       2022-01-02
           ...
1045    2023-12-27
1046    2023-12-27
1047    2023-12-28
1048    2023-12-28
1049    2023-12-30
Name: transaction_date, Length: 1050, dtype: object

In [ ]:
from datetime import datetime

ans = datetime.strptime(df['transaction_date'][1046], "%Y-%m-%d").strftime("%d-%m-%Y")

# ans

# all_dates = []

# for date in df['transaction_date']:
#     all_dates.append(datetime.strptime(date, "%d/%m/%Y").strftime("%d-%m-%Y"))

#  date_series = pd.Series(all_dates)

# date_series

In [18]:
df['transaction_date'] = date_series

NameError: name 'date_series' is not defined

In [25]:
df['transaction_date']

0      2022-01-01
1      2022-01-01
2      2022-01-02
3      2022-01-02
4      2022-01-02
          ...
1045   2023-12-27
1046   2023-12-27
1047   2023-12-28
1048   2023-12-28
1049   2023-12-30
Name: transaction_date, Length: 1050, dtype: datetime64[ns]

In [24]:
df

      customer_id           name transaction_date       amount category
0             103  Charlie Davis       2022-01-01   759.037390        A
1             436    Alice Brown       2022-01-01  1096.181632        C
2             861    Alice Brown       2022-01-02  1158.623597        B
3             271     Bob Wilson       2022-01-02   859.027857      NaN
4             107     John Smith       2022-01-02   712.566977        C
...           ...            ...              ...          ...      ...
1045           85     John Smith       2023-12-27   761.082210        C
1046           78    Alice Brown       2023-12-27  1003.574745        B
1047          457  Charlie Davis       2023-12-28   832.511670        C
1048          878  Charlie Davis       2023-12-28   723.357978        B
1049            1     Bob Wilson       2023-12-30   721.611291        C

[1050 rows x 5 columns]

In [23]:
df['transaction_date'].head(10)

0   2022-01-01
1   2022-01-01
2   2022-01-02
3   2022-01-02
4   2022-01-02
5   2022-01-03
6   2022-01-03
7   2022-01-03
8   2022-01-07
9   2022-01-07
Name: transaction_date, dtype: datetime64[ns]

In [22]:
df["transaction_date"] = pd.to_datetime(df["transaction_date"])

In [21]:
df["transaction_date"]

0       2022-01-01
1       2022-01-01
2       2022-01-02
3       2022-01-02
4       2022-01-02
           ...
1045    2023-12-27
1046    2023-12-27
1047    2023-12-28
1048    2023-12-28
1049    2023-12-30
Name: transaction_date, Length: 1050, dtype: object

In [20]:
df

      customer_id           name transaction_date       amount category
0             103  Charlie Davis       2022-01-01   759.037390        A
1             436    Alice Brown       2022-01-01  1096.181632        C
2             861    Alice Brown       2022-01-02  1158.623597        B
3             271     Bob Wilson       2022-01-02   859.027857      NaN
4             107     John Smith       2022-01-02   712.566977        C
...           ...            ...              ...          ...      ...
1045           85     John Smith       2023-12-27   761.082210        C
1046           78    Alice Brown       2023-12-27  1003.574745        B
1047          457  Charlie Davis       2023-12-28   832.511670        C
1048          878  Charlie Davis       2023-12-28   723.357978        B
1049            1     Bob Wilson       2023-12-30   721.611291        C

[1050 rows x 5 columns]

In [26]:
df.isnull().sum()

customer_id          0
name                 0
transaction_date     0
amount               0
category            45
dtype: int64

In [27]:
df.dropna(inplace=True)

In [28]:
df

      customer_id           name transaction_date       amount category
0             103  Charlie Davis       2022-01-01   759.037390        A
1             436    Alice Brown       2022-01-01  1096.181632        C
2             861    Alice Brown       2022-01-02  1158.623597        B
4             107     John Smith       2022-01-02   712.566977        C
5              72    Alice Brown       2022-01-03   749.303000        B
...           ...            ...              ...          ...      ...
1045           85     John Smith       2023-12-27   761.082210        C
1046           78    Alice Brown       2023-12-27  1003.574745        B
1047          457  Charlie Davis       2023-12-28   832.511670        C
1048          878  Charlie Davis       2023-12-28   723.357978        B
1049            1     Bob Wilson       2023-12-30   721.611291        C

[1005 rows x 5 columns]

In [29]:
df.isna().sum()

customer_id         0
name                0
transaction_date    0
amount              0
category            0
dtype: int64

In [30]:
df = pd.read_csv("transactions.csv")

In [31]:
df.isna().sum()

customer_id          0
name                 0
transaction_date     0
amount               0
category            45
dtype: int64

In [32]:
df['category'] = df["category"].fillna("-")

In [33]:
df.isna().sum()

customer_id         0
name                0
transaction_date    0
amount              0
category            0
dtype: int64

In [34]:
df

      customer_id           name transaction_date       amount category
0             103  Charlie Davis       2022-01-01   759.037390        A
1             436    Alice Brown       2022-01-01  1096.181632        C
2             861    Alice Brown       2022-01-02  1158.623597        B
3             271     Bob Wilson       2022-01-02   859.027857        -
4             107     John Smith       2022-01-02   712.566977        C
...           ...            ...              ...          ...      ...
1045           85     John Smith       2023-12-27   761.082210        C
1046           78    Alice Brown       2023-12-27  1003.574745        B
1047          457  Charlie Davis       2023-12-28   832.511670        C
1048          878  Charlie Davis       2023-12-28   723.357978        B
1049            1     Bob Wilson       2023-12-30   721.611291        C

[1050 rows x 5 columns]

In [ ]:
# df["amount"].fillna(df["amount"].mean(), inplace=True)

In [35]:
df.isna().sum()

customer_id         0
name                0
transaction_date    0
amount              0
category            0
dtype: int64

In [36]:
df.duplicated()

0       False
1       False
2       False
3       False
4       False
        ...
1045    False
1046    False
1047    False
1048    False
1049    False
Length: 1050, dtype: bool

In [37]:
print(df.duplicated().sum())

0

In [38]:
df.drop_duplicates(inplace=True)

In [39]:
df.duplicated().sum()

np.int64(0)

In [ ]:
df.dtypes

customer_id           int64
name                 object
transaction_date     object
amount              float64
category             object
dtype: object

In [ ]:
ndf = df["amount"].astype("int32")

NameError: name 'df' is not defined

In [ ]:
ndf.dtypes

dtype('int32')

In [ ]:
# ndf

In [ ]:
df

In [ ]:
df.dtypes

In [ ]:
df.to_csv("filtered_transactions.csv", index=False)